[
  {"scenario": "A garbage truck is stopped in your lane and a line of cars is forming behind it.", "question": "Are we going to wait or pass the truck?"},
  {"scenario": "A child is flying a kite on the sidewalk, with the string sometimes drifting into the street.", "question": "Why did you slow down here?"},
  {"scenario": "The car in front signals a left turn but moves very slowly.", "question": "Why are you keeping so much distance?"},
  {"scenario": "Road crews are repainting lane markings ahead, partially blocking the right lane.", "question": "Are you changing lanes because of the workers?"},
  {"scenario": "A motorcycle weaves through stopped traffic during rush hour.", "question": "Why did you stop suddenly for the motorcycle?"},
  {"scenario": "A bicyclist signals a right turn and moves into your lane.", "question": "How do you decide when to pass a bike?"},
  {"scenario": "Fog makes it hard to see the vehicles ahead on a rural road.", "question": "Why did you turn on the fog lights?"},
  {"scenario": "An unmarked police car turns on its siren behind you.", "question": "Do we need to pull over for this vehicle?"},
  {"scenario": "The GPS suggests a detour due to heavy traffic on the main road.", "question": "Should we follow the GPS detour or stay on this road?"},
  {"scenario": "A dog off-leash is running alongside the road near a park.", "question": "Are you watching for the dog to cross?"},
  {"scenario": "A tractor is driving very slowly on a single-lane country road.", "question": "Will we pass the tractor or stay behind it?"},
  {"scenario": "School just let out and children are gathering near a crosswalk.", "question": "Why are you stopping so far back from the crosswalk?"},
  {"scenario": "A heavy rainstorm starts and water is pooling on the pavement.", "question": "Will you slow down to avoid hydroplaning?"},
  {"scenario": "The car is driving in a neighborhood with many speed bumps.", "question": "Why did you slow down for the bumps?"},
  {"scenario": "A fire hydrant is leaking water onto the street and cars are splashing through.", "question": "Are you going to drive through the water or avoid it?"},
  {"scenario": "A parade is blocking a main street downtown.", "question": "Why did you turn onto a side street?"},
  {"scenario": "A utility worker is climbing a pole near the road.", "question": "Is it safe to drive by with workers overhead?"},
  {"scenario": "Traffic lights are flashing yellow after a power outage.", "question": "How do you decide when to go through a flashing yellow?"},
  {"scenario": "A bridge ahead has a weight limit sign posted.", "question": "Are we under the weight limit for this bridge?"},
  {"scenario": "A jogger crosses mid-block, not at a crosswalk.", "question": "Why did you yield for the pedestrian here?"},
  {"scenario": "An animal crossing sign warns of deer in the area.", "question": "Are you extra alert for deer right now?"},
  {"scenario": "Snow is falling and the windshield wipers are on high speed.", "question": "Will you reduce speed in the snow?"},
  {"scenario": "An ice cream truck is parked at the curb with children nearby.", "question": "Why are you driving so slowly past the truck?"},
  {"scenario": "A vehicle is weaving between lanes on the highway.", "question": "Why did you increase following distance behind that car?"},
  {"scenario": "Construction cones merge two lanes into one ahead.", "question": "When will you merge for the construction zone?"},
  {"scenario": "A railroad crossing gate is coming down and the warning lights flash.", "question": "Why did you stop before the tracks?"},
  {"scenario": "A food delivery cyclist rides between parked cars and the curb.", "question": "How do you watch out for cyclists near parked cars?"},
  {"scenario": "A minivan is parked with its hazard lights flashing.", "question": "Should we go around the parked minivan?"},
  {"scenario": "A slow-moving funeral procession is entering the intersection.", "question": "Why did you wait for the whole procession to pass?"},
  {"scenario": "A moving van blocks most of a narrow street during a house move.", "question": "Are you going to wait or squeeze by the van?"},
  {"scenario": "An emergency alert warns of a tornado nearby.", "question": "Will you pull over if the weather gets worse?"},
  {"scenario": "A driver honks and gestures aggressively after a merge.", "question": "How do you handle road rage from other drivers?"},
  {"scenario": "A fallen tree branch partially blocks the shoulder of the road.", "question": "Will you move over to avoid the branch?"},
  {"scenario": "A taxi suddenly pulls over to pick up a passenger.", "question": "Why did you brake when the taxi stopped?"},
  {"scenario": "A traffic officer is waving cars through a broken traffic light.", "question": "Do you always follow the officer's hand signals?"},
  {"scenario": "A slow train crosses a busy intersection during rush hour.", "question": "Why did you turn down a different street instead of waiting?"},
  {"scenario": "A tow truck is loading a disabled vehicle at the side of the highway.", "question": "Why do you move over for the tow truck?"},
  {"scenario": "A car ahead has its turn signal on but doesn't turn.", "question": "How do you know if the other driver will actually turn?"},
  {"scenario": "Street sweepers are cleaning the curb lane early in the morning.", "question": "Why are you avoiding the right lane right now?"},
  {"scenario": "A road sign warns of falling rocks on a mountain pass.", "question": "Are you more cautious in areas with falling rock signs?"},
  {"scenario": "A car in the opposite lane flashes its headlights.", "question": "What does it mean when another driver flashes their lights?"},
  {"scenario": "A cyclist signals to merge left to avoid a pothole.", "question": "Do you adjust your speed for cyclists making signals?"},
  {"scenario": "A pedestrian stumbles and drops something in the crosswalk.", "question": "Why did you wait until the pedestrian was clear?"},
  {"scenario": "The traffic app announces a sudden slowdown ahead.", "question": "Will you take an alternate route due to traffic?"},
  {"scenario": "The streetlights are out during a night drive.", "question": "Why did you reduce speed with the lights out?"},
  {"scenario": "A car stops suddenly to parallel park.", "question": "Why did you wait for the car to finish parking before passing?"},
  {"scenario": "A bird swoops low over the road as you approach.", "question": "Why did you hesitate when the bird flew by?"},
  {"scenario": "A moving sidewalk warning sign appears near an airport terminal.", "question": "How do you watch for people near moving walkways?"},
  {"scenario": "A new traffic circle replaces an old intersection.", "question": "How do you decide when to enter the new traffic circle?"},
  {"scenario": "The curb lane is closed for street fair vendors.", "question": "Why did you merge out of the curb lane early?"},
  {"scenario": "A truck drops small debris onto the highway.", "question": "Are you taking precautions when you see debris fall?"},
  {"scenario": "The stop sign is partially covered by tree branches.", "question": "How do you spot traffic signs that are hard to see?"},
  {"scenario": "A car ahead slows for a speed camera zone.", "question": "Do you always reduce speed in camera areas?"},
  {"scenario": "A scooter is zig-zagging around pedestrians on the sidewalk.", "question": "Why are you watching the scooter so closely?"},
  {"scenario": "A driver waves you through at a four-way stop.", "question": "Is it safe to trust another driver's hand wave?"},
  {"scenario": "The road is freshly paved and there are no visible lane markings.", "question": "How do you keep your position without lines?"},
  {"scenario": "A utility box cover is loose and rattling in the street.", "question": "Will you avoid driving over the loose cover?"},
  {"scenario": "A tractor-trailer makes a wide right turn across two lanes.", "question": "Why did you stay back during the truck's turn?"},
  {"scenario": "An overpass has a low clearance warning sign.", "question": "Do we need to worry about the clearance with our car?"},
  {"scenario": "A rideshare driver double-parks to let someone out.", "question": "Why are you waiting behind the rideshare car?"},
  {"scenario": "A pothole repair crew is working ahead with cones.", "question": "Why are you slowing down for the road crew?"},
  {"scenario": "The car's tire pressure warning comes on during a drive.", "question": "Will you stop to check the tires now?"},
  {"scenario": "A motorcycle group rides together in a staggered formation.", "question": "How do you safely pass a group of motorcycles?"},
  {"scenario": "An old railroad track crosses the road with bumpy pavement.", "question": "Why did you slow for the rough railroad crossing?"},
  {"scenario": "A delivery van blocks your view of a driveway.", "question": "Do you adjust your speed when sight lines are blocked?"},
  {"scenario": "An animal shelter is holding a pet adoption event by the roadside.", "question": "Are you extra careful driving near the event?"},
  {"scenario": "A small landslide left loose gravel on the mountain road.", "question": "How do you handle unexpected road debris?"},
  {"scenario": "A pedestrian is walking a large dog that looks anxious.", "question": "Why are you keeping extra distance from the dog walker?"},
  {"scenario": "A detour sign redirects traffic through a quiet neighborhood.", "question": "Why did you slow down more on the side streets?"},
  {"scenario": "A new stoplight has been installed at a busy intersection.", "question": "How do you handle unfamiliar traffic lights?"},
  {"scenario": "A tree trimmer's truck blocks one lane, with workers overhead.", "question": "Do you wait for the all-clear before passing under workers?"},
  {"scenario": "A parade of vintage cars moves slowly down Main Street.", "question": "Why are you staying so far back from the parade?"},
  {"scenario": "A family on bicycles is riding together across an intersection.", "question": "Are you letting all the bikes cross before you go?"},
  {"scenario": "The drawbridge is opening for a boat to pass.", "question": "Why did you stop so far back from the drawbridge?"},
  {"scenario": "A car alarm is going off in a parking garage.", "question": "Do you take extra care when an alarm is sounding nearby?"},
  {"scenario": "Street musicians are performing near the crosswalk.", "question": "Why did you slow down near the crowd by the musicians?"},
  {"scenario": "A moving walkway is out of order at the airport curb.", "question": "Will you let passengers exit before moving forward?"},
  {"scenario": "A water main break has caused flooding on a city street.", "question": "Are you taking a different route to avoid the water?"},
  {"scenario": "A funeral home is directing a procession into the street.", "question": "Do you always yield to funeral processions?"},
  {"scenario": "A service animal is guiding a visually impaired person across the street.", "question": "Why did you stop for the service animal and person?"},
  {"scenario": "A classic car show is attracting crowds near downtown.", "question": "Why are you avoiding the main street during the show?"},
  {"scenario": "A city bus breaks down in the lane ahead, blocking traffic.", "question": "Are you waiting or will you change lanes to pass the bus?"},
  {"scenario": "A skateboarder carries their board and jogs across the road.", "question": "Why did you wait until the skateboarder reached the sidewalk?"},
  {"scenario": "A tree's leaves cover a stop sign at a busy intersection.", "question": "How did you know to stop with the sign covered?"},
  {"scenario": "A street sweeper leaves wet tracks behind in the early morning.", "question": "Are you avoiding the slick tracks left by the sweeper?"},
  {"scenario": "A protest march is moving down the avenue with police escorts.", "question": "Why did you reroute instead of waiting for the march?"},
  {"scenario": "A group of tourists is jaywalking near a famous landmark.", "question": "Are you slowing down for the jaywalkers?"},
  {"scenario": "A truck's load of gravel is spilling onto the highway.", "question": "How do you avoid the gravel from the truck?"},
  {"scenario": "A food truck is parked with a line of customers at the curb.", "question": "Why are you driving slowly near the food truck crowd?"},
  {"scenario": "A bicycle courier speeds through a red light in the city.", "question": "Why did you hesitate before entering the intersection?"},
  {"scenario": "A row of garbage bins is tipped over after a windy night.", "question": "Will you slow down or swerve for the bins?"},
  {"scenario": "A car with foreign license plates is driving unusually slowly.", "question": "Why are you patient with the slow-moving car?"},
  {"scenario": "A delivery robot crosses the street ahead.", "question": "Do you always yield for robots in crosswalks?"},
  {"scenario": "A road sign warns of loose livestock in the area.", "question": "Are you extra watchful for animals when you see that sign?"},
  {"scenario": "A car pulls a trailer with a loose tarp flapping behind.", "question": "Are you increasing distance from the car with the trailer?"},
  {"scenario": "An RV is making a wide U-turn at a busy intersection.", "question": "Why did you wait for the RV to finish turning before going?"},
  {"scenario": "A convertible ahead suddenly stops to put its top up in the rain.", "question": "Why are you waiting for the convertible before passing?"},
  {"scenario": "A fire hydrant is open and water is spraying across the street.", "question": "Will you find another way to avoid the water spray?"},
  {"scenario": "A bicycle is carrying a large package and is unsteady.", "question": "Are you giving more room for the wobbly cyclist?"}
]
